// Массивы

// let arr = ['1',{},[],25]

// arr[0] == '1'

// arr[2] == []

// Методы массивов 

// arr.push('a')  добавить элемент в конец массива 

// arr.pop() - удалить последний элемент из массива и возвращает его

// arr.shift() - удалить из массива перывй элемент и возвращает его

// arr.unshift('a') - добавить в начало массива 

// arr.split(s) -  превратить строку в массив , s - разделитель

// arr.join(s) -  превратить массив в строку , s - разделитель

// delete arr[1] - удаляет второй элемент 

// arr.slice(begin, end) - копирует часть массив с begin до end не включая

// arr.splice(index, count,elem1...) - удалить count элементов начиная  с index  и заменить на elem1

// arr.sort(fn) - сортировка массива если не передать функцию сравнения - сортирует элементы как строки

// arr.reserve() - меняет порядок элементов на обратный

// arr.concat(item1...) - создает новый массив в который копируется элементы из arr , а также item1...

// методы перебора 

// arr.forEach 

// arr.map 

// arr.every/some 

// arr.filter 
 
// arr.reduce 




